{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"kernel_size": [5, 5], "trainable": true, "bias_regularizer": null, "dtype": "float32", "strides": [1, 1], "data_format": "channels_first", "use_bias": true, "batch_input_shape": [null, 1, 28, 28], "dilation_rate": [1, 1], "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 30, "name": "conv2d_7", "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_first", "name": "max_pooling2d_7", "trainable": true, "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "trainable": true, "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_first", "use_bias": true, "dilation_rate": [1, 1], "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 15, "name": "conv2d_8", "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_first", "name": "max_pooling2d_8", "trainable": true, "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "noise_shape": null, "name": "dropout_4", "seed": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_4"}}, {"class_name": "Dense", "config": {"units": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "name": "dense_10", "activity_regularizer": null, "activation": "relu"}}, {"class_name": "Dense", "config": {"units": 50, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "name": "dense_11", "activity_regularizer": null, "activation": "relu"}}, {"class_name": "Dense", "config": {"units": 10, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "trainable": true, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "name": "dense_12", "activity_regularizer": null, "activation": "softmax"}}], "keras_version": "2.1.4"}